feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/iLLD/TC27D/Tricore/Dsadc/Rdc/IfxDsadc_Rdc.h
/** \} */

/** \addtogroup IfxLld_Dsadc_Rdc_structures
 * \{ */
/** \brief RDC hardware configuration
 */
typedef struct
{
    IfxDsadc_Dsadc_ChannelConfig    inputConfig;           /**< \brief Default channel configuration for both SIN and COS input. */
    IfxDsadc_ChannelId              inputSin;              /**< \brief Channel ID of DSADC used for SIN input. This will override value given in the inputConfig */
    IfxDsadc_ChannelId              inputCos;              /**< \brief Channel ID of DSADC used for COS input. This will override value given in the inputConfig */
    Ifx_Priority                    servReqPriority;       /**< \brief Interrupt priority. NOTE: Only used by inputSin and will override value given in the inputConfig */
    IfxSrc_Tos                      servReqProvider;       /**< \brief Service provider. NOTE: Only used by inputSin and will override value given in the inputConfig */
    boolean                         startScan;             /**< \brief Specifies whether the conversion will be started as soon as the IfxDsadc_Rdc_initHw() is called */
    IfxDsadc_Dsadc_CarrierGenConfig carrierGen;            /**< \brief Pointer to the carrier signal generation configuration.
                                                            * \note If NULL_PTR, it is assumed that the carrier generation has been pre-configured */
    IfxDsadc_Cout_Out              *outputClock;           /**< \brief if not NULL_PTR, modulator clock output pin from inputSin channel will be configured */
    IfxDsadc_Rdc_GtmTimestamp       gtmTimestamp;          /**< \brief Timestamp helper using GTM */
} IfxDsadc_Rdc_ConfigHw;

/** \brief DSADC RDC hardware object structure
 */
typedef struct
{
    IfxDsadc_Dsadc_Channel inputSin;       /**< \brief Handle to SIN input channel */
    IfxDsadc_Dsadc_Channel inputCos;       /**< \brief Handle to COS input channel */
    Ifx_GTM_TIM_CH        *pwmTimCh;       /**< \brief TIM channel for PWM timestamp */
    Ifx_GTM_TIM_CH        *rdcTimCh;       /**< \brief TIM channel for DSADC timestamp */
} IfxDsadc_Rdc_Hw;

/** \brief
 */
typedef struct
{
    boolean enabled;
    float32 inSeconds;
    uint32  rdc;               /**< \brief Absolute time of DSADC result */
    uint32  pwm;               /**< \brief Absolute time of user's PWM trigger. Used only if IFXDSADC_RDC_CFG_DEBUG  is set */
    sint32  inTicks;           /**< \brief Time-stamp of last result (in ticks). Used only if IFXDSADC_RDC_CFG_DEBUG is set */
    uint32  maxTicks;          /**< \brief Maximum time-stamp value (in ticks of absolute time clock) */
    float32 clockPeriod;       /**< \brief Period of absolute time clock (in second) */
} IfxDsadc_Rdc_Ts;

/** \} */

/** \addtogroup IfxLld_Dsadc_Rdc_structures
 * \{ */
/** \brief DSADC RDC data structure
 */
typedef struct
{
    Ifx_AngleTrkF32 angleTrk;
    sint16          sinIn;
    sint16          cosIn;
    float32         updatePeriod;
    float32         groupDelay;
    IfxDsadc_Rdc_Hw hardware;
    IfxDsadc_Rdc_Ts timestamp;
} IfxDsadc_Rdc;

/** \brief DSADC RDC configuration structure
 *  Note: if ALL kp, ki, kd are zero, then the init function will use default value.
 */
typedef struct
{
    float32               kp;                      /**< \brief Observer proportional gain */
    float32               ki;                      /**< \brief Observer integral gain */
    float32               kd;                      /**< \brief Observer differential gain */
    float32               speedLpfFc;              /**< \brief Cut-off frequency of speed low-pass filter (in Hertz). */
    float32               errorThreshold;          /**< \brief Threshold of error value in the tracking loop (in radian) */
    float32               userTs;                  /**< \brief Sampling period of the application */
    sint32                sqrAmplMax;              /**< \brief Maximum value for square of signal amplitudes */
    sint32                sqrAmplMin;              /**< \brief Minimum value for square of signal amplitudes */
    uint16                periodPerRotation;       /**< \brief Number of electrical periods per mechanical rotation */
    boolean               reversed;                /**< \brief TRUE: reversed direction, FALSE: straight direction */
    sint32                resolution;              /**< \brief Sensor resolution */
    IfxStdIf_Pos_RawAngle offset;                  /**< \brief Offset in ticks. [0 .. (\ref IfxDsadc_Rdc_Config.resolution - 1)] */
    IfxDsadc_Rdc_ConfigHw hardware;                /**< \brief Pointer to hardware config. */
    IfxDsadc_Dsadc       *dsadc;                   /**< \brief Pointer to the DSADC driver */
} IfxDsadc_Rdc_Config;

/** \} */

/** \addtogroup IfxLld_Dsadc_Rdc_func_config
 * \{ */

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Initialise the DSADC RDC driver by initialising:
 *  - Two DSADC hardware channel resources
 *  - Carrier generation hardware resources
 *  - Time-stamp hardware resources
 *  - Driver's run-time data (RAM): tracking observer, fault-detection, interface layer etc.
 * \param driver Driver's handle, i.e. pointer to \ref IfxDsadc_Rdc RAM location
 * \param config Config Pointer to the driver's configuration
 * \return TRUE in case of success else FALSE
 */
IFX_EXTERN boolean IfxDsadc_Rdc_init(IfxDsadc_Rdc *driver, const IfxDsadc_Rdc_Config *config);

/** \brief
 * \param config DSADC RDC configuration structure
 * \return None
 */
IFX_EXTERN void IfxDsadc_Rdc_initConfig(IfxDsadc_Rdc_Config *config);

/** \} */

/** \addtogroup IfxLld_Dsadc_Rdc_library_srvsw_sysse_virtualDevice_positionSensor_StdIf_Functions
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief \see IfxStdIf_Pos_GetFault
 * \param driver Driver handle
 * \return Fault
 */
IFX_INLINE IfxStdIf_Pos_Status IfxDsadc_Rdc_getFault(IfxDsadc_Rdc *driver);

/** \brief \see IfxStdIf_Pos_GetPeriodPerRotation
 * \param driver Driver handle
 * \return Period per rotation
 */
IFX_INLINE uint16 IfxDsadc_Rdc_getPeriodPerRotation(IfxDsadc_Rdc *driver);

