feaser/openblt/stm32c0_port/Target/Demo/TRICORE_TC2_TC275_Lite_Kit_ADS/Prog/Libraries/iLLD/TC27D/Tricore/Dsadc/Rdc/IfxDsadc_Rdc.h
/** \brief \see IfxStdIf_Pos_GetRawPosition
 * \param driver Driver handle
 * \return Position in ticks
 */
IFX_INLINE IfxStdIf_Pos_RawAngle IfxDsadc_Rdc_getRawPosition(IfxDsadc_Rdc *driver);

/** \brief \see IfxStdIf_Pos_GetSpeed
 * \param driver Driver handle
 * \return speed
 */
IFX_INLINE float32 IfxDsadc_Rdc_getSpeed(IfxDsadc_Rdc *driver);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief see IfxStdIf_Pos_GetAbsolutePosition
 * \param driver Driver handle
 * \return Absolute position
 */
IFX_EXTERN float32 IfxDsadc_Rdc_getAbsolutePosition(IfxDsadc_Rdc *driver);

/** \brief \see IfxStdIf_Pos_GetDirection
 * \param driver Driver handle
 * \return Direction
 */
IFX_EXTERN IfxStdIf_Pos_Dir IfxDsadc_Rdc_getDirection(IfxDsadc_Rdc *driver);

/** \brief \see IfxStdIf_Pos_GetOffset
 * \param driver Driver handle
 * \return Offset address
 */
IFX_EXTERN sint32 IfxDsadc_Rdc_getOffset(IfxDsadc_Rdc *driver);

/** \brief \see IfxStdIf_Pos_GetPosition
 * \param driver Driver handle
 * \return Position
 */
IFX_EXTERN float32 IfxDsadc_Rdc_getPosition(IfxDsadc_Rdc *driver);

/** \brief \see IfxStdIf_Pos_GetRefreshPeriod
 * \param driver driver handle
 * \return Update period
 */
IFX_EXTERN float32 IfxDsadc_Rdc_getRefreshPeriod(IfxDsadc_Rdc *driver);

/** \brief \see IfxStdIf_Pos_GetResolution
 * \param driver Driver handle
 * \return Resolution
 */
IFX_EXTERN sint32 IfxDsadc_Rdc_getResolution(IfxDsadc_Rdc *driver);

/** \brief \see IfxStdIf_Pos_GetSensorType
 * \param driver driver handle
 * \return Sensor type
 */
IFX_EXTERN IfxStdIf_Pos_SensorType IfxDsadc_Rdc_getSensorType(IfxDsadc_Rdc *driver);

/** \brief \see IfxStdIf_Pos_GetTurn
 * \param driver Driver handle
 * \return Returns the number of turns
 */
IFX_EXTERN sint32 IfxDsadc_Rdc_getTurn(IfxDsadc_Rdc *driver);

/** \brief \see IfxStdIf_Pos_OnEventA
 * The API handles the event A which corresponds to the DSADC interrupt event.
 * \param driver Driver's handle
 * \return None
 */
IFX_EXTERN void IfxDsadc_Rdc_onEventA(IfxDsadc_Rdc *driver);

/** \brief \see IfxStdIf_Pos_Reset
 * \param driver Driver handle
 * \return None
 */
IFX_EXTERN void IfxDsadc_Rdc_reset(IfxDsadc_Rdc *driver);

/** \brief \see IfxStdIf_Pos_ResetFaults
 * \param driver Driver handle
 * \return None
 */
IFX_EXTERN void IfxDsadc_Rdc_resetFaults(IfxDsadc_Rdc *driver);

/** \brief \see IfxStdIf_Pos_SetOffset
 * \param driver Driver handle
 * \param offset Offset
 * \return None
 */
IFX_EXTERN void IfxDsadc_Rdc_setOffset(IfxDsadc_Rdc *driver, sint32 offset);

/** \brief \see IfxStdIf_Pos_SetRefreshPeriod
 * \param driver Driver handle
 * \param updatePeriod Update period
 * \return None
 */
IFX_EXTERN void IfxDsadc_Rdc_setRefreshPeriod(IfxDsadc_Rdc *driver, float32 updatePeriod);

/** \brief Initializes the standard interface "Pos"
 * \param stdif Standard interface position object
 * \param driver Virtual position sensor
 * \return TRUE on success else FALSE
 */
IFX_EXTERN boolean IfxDsadc_Rdc_stdIfPosInit(IfxStdIf_Pos *stdif, IfxDsadc_Rdc *driver);

/** \brief \see IfxStdIf_Pos_Update
 * This function is to be executed at user's application interrupt or task, e.g. motor control
 * \param driver Driver's handle
 * \return None
 */
IFX_EXTERN void IfxDsadc_Rdc_update(IfxDsadc_Rdc *driver);

/** \} */

/** \addtogroup IfxLld_Dsadc_Rdc_func_utility
 * \{ */

/******************************************************************************/
/*-------------------------Inline Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Return timestamp in seconds
 * \param driver Driver handle
 * \return timestamp in seconds.
 */
IFX_INLINE float32 IfxDsadc_Rdc_getTimestamp(IfxDsadc_Rdc *driver);

/******************************************************************************/
/*-------------------------Global Function Prototypes-------------------------*/
/******************************************************************************/

/** \brief Synchronously start of both DSADC H/W channels
 * \param driver Driver's handle, i.e. pointer to \ref IfxDsadc_Rdc RAM location
 * \return None
 */
IFX_EXTERN void IfxDsadc_Rdc_startConversion(IfxDsadc_Rdc *driver);

/** \} */

/******************************************************************************/
/*---------------------Inline Function Implementations------------------------*/
/******************************************************************************/

IFX_INLINE IfxStdIf_Pos_Status IfxDsadc_Rdc_getFault(IfxDsadc_Rdc *driver)
{
    return Ifx_AngleTrkF32_getFault(&driver->angleTrk);
}


IFX_INLINE uint16 IfxDsadc_Rdc_getPeriodPerRotation(IfxDsadc_Rdc *driver)
{
    return Ifx_AngleTrkF32_getPeriodPerRotation(&driver->angleTrk);
}


IFX_INLINE IfxStdIf_Pos_RawAngle IfxDsadc_Rdc_getRawPosition(IfxDsadc_Rdc *driver)
{
    return Ifx_AngleTrkF32_getRawPosition(&driver->angleTrk);
}


IFX_INLINE float32 IfxDsadc_Rdc_getSpeed(IfxDsadc_Rdc *driver)
{
    return Ifx_AngleTrkF32_getSpeed(&driver->angleTrk);
}


IFX_INLINE float32 IfxDsadc_Rdc_getTimestamp(IfxDsadc_Rdc *driver)
{
    return driver->timestamp.inSeconds;
}


#endif /* IFXDSADC_RDC_H */
